Обработки/DataProcessors/_РасчетДоходностиДляРисков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_РасчетДоходностиДляРисков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемаяБазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаДУ</Name>
					<Comment>Значение - СправочникСсылка.СчетаДоверительногоУправления</Comment>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПростаяГодоваяДоходность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭффективнаяГодоваяДоходность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьАктивовНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьАктивовНаКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВПериоде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяДоходность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаГарантированногоДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыводДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВключениеПрочегоИмуществаВСоставПИФ</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыводКредитногоИнструмента</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводКредитногоИнструмента</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейВУправлении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_РасчетДоходностиДляРисков/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ИспользуемаяБазаДанных = "Рабочая";
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.УстановитьПараметрыСоединенияСSQL();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Список значений "СчетаДУ" не имеет фиксированного типа данных, поэтому его нужно установить
	Объект.СчетаДУ.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления");
	
	ДатаНачалаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	Объект.ИспользуемаяБазаДанных = "Рабочая";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ДатаНачалаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаНачалаПриИзмененииНаСервере()
	КоличествоКалендарныхДней = (Объект.ДатаОкончания - Объект.ДатаНачала) / (60 * 60 * 24) + 1;
	Попытка
		КоличествоТорговыхДней = Справочники.Календари.КоличествоРабочихДней(
			ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"), Объект.ДатаНачала, Объект.ДатаОкончания);
	Исключение
	КонецПопытки;
	Объект.ТаблицаДанных.Очистить();
	Объект.ТаблицаОпераций.Очистить();
	ТаблицаВыбранныхОпераций.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПриАктивизацииСтроки(Элемент)
	// Составление списка счетов ДУ
	ВыбранныеСчетаДУ = Новый Соответствие(); // Соответствие(Справочник.СчетДоверительногоУправления, Истина)
	Для Каждого ВыделеннаяСтрока Из Элементы.ТаблицаДанных.ВыделенныеСтроки Цикл
		НайденнаяСтрока = Объект.ТаблицаДанных.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВыбранныеСчетаДУ.Вставить(НайденнаяСтрока.СчетДоверительногоУправления, Истина);
	КонецЦикла;
	// Поиск нужных строк операций и вывод их в таблицу интерфейса
	ТаблицаВыбранныхОпераций.Очистить();
	Для Каждого КлючЗначение Из ВыбранныеСчетаДУ Цикл
		ВыбранныйСчетДУ = КлючЗначение.Ключ;
		НайденныеСтроки = Объект.ТаблицаОпераций.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", ВыбранныйСчетДУ));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СтрокаВыбранныхОпераций = ТаблицаВыбранныхОпераций.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВыбранныхОпераций, НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	ТаблицаВыбранныхОпераций.Сортировать("Период, Операция");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	ТаблицаВыбранныхОпераций.Очистить();
	// Получение данных и заполнение таблиц формы
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьПоТекущимПараметрам();
	ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузить(Команда)
	// Проверка корректности параметров
	Если Объект.ТаблицаДанных.Количество() = 0 Тогда
		Предупреждение("Таблица пустая. Заполнение происходит через кнопку ""Заполнить"".",, "Проверка корректности параметров");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Предупреждение("Даты начала и окончания должны быть заполнены.",, "Проверка корректности параметров");
		Возврат;
	КонецЕсли;
	КоличествоОбработанныхЗаписей = КомандаВыгрузитьНаСервере();
	Если КоличествоОбработанныхЗаписей <> Неопределено И КоличествоОбработанныхЗаписей > 0 Тогда
		Предупреждение("Выгружено записей: " + КоличествоОбработанныхЗаписей,, "Результат выполнения");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КомандаВыгрузитьНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектЗначение.ВыгрузитьДанныеВSQL();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	ПриСменеТекущейОрганизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСменеТекущейОрганизацииНаСервере() Экспорт
	// Не используется после того, как осталась одна компания (14 апреля 2026)
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
КонецПроцедуры

#КонецОбласти
